the
of
given
return
a
and
is
in
an
to
that
are
you
if
array
integer
number
all
it
be
each
where
can
with
for
1
two
any
n
or
there
from
one
not
0
as
by
at
order
integers
string
such
on
have
example
this
has
x
may
only
nums
same
following
will
answer
no
length
-
2
binary
must
i
minimum
k
after
s
value
possible
maximum
than
true
we
note
some
list
its
should
sum
first
so
which
elements
every
into
equal
ith
left
between
then
strings
find
more
characters
right
otherwise
int
tree
represents
ie
your
exactly
false
nodes
numbers
values
3
element
time
result
valid
contains
m
-1
write
sorted
also
node
row
root
different
most
them
make
column
character
unique
other
positive
they
b
least
empty
times
both
letters
implement
their
j
format
either
type
key
three
words
representing
size
class
does
represented
matrix
arr
once
query
cannot
index
using
move
when
sequence
returns
multiple
name
range
exists
consists
position
non-empty
table
adjacent
digits
guaranteed
smallest
do
grid
these
choose
target
7
initializes
another
less
distinct
want
largest
input
object
contain
primary
sql
schema
without
4
last
initially
end
need
set
next
path
starting
rules
pair
indices
c
use
0-indexed
up
lowercase
start
get
total
single
remove
substring
operation
assume
generated
test
y
new
consecutive
numsi
design
large
109
arrays
word
always
letter
moves
before
take
until
second
function
algorithm
solution
cell
modulo
operations
above
subarray
four
greater
linked
but
form
containing
5
original
zero
allowed
cases
defined
since
follows
game
2d
point
id
within
1s
remaining
even
head
square
cells
t
used
step
reach
day
exist
means
notice
contiguous
rows
void
steps
respectively
varchar
indicates
was
longest
inclusive
non-negative
top
ascending
called
formed
english
xi
output
product
could
10
0s
change
connected
down
turn
while
data
subsequence
null
space
search
amount
difference
32-bit
positions
points
starts
determine
add
structure
current
6
pick
leading
ends
yi
person
edge
case
needed
pairs
many
part
possibly
9
strictly
digit
represent
children
split
complexity
consisting
val
considered
previous
how
because
ordered
removing
would
who
denotes
made
board
ways
problem
non-decreasing
representation
way
arri
answers
directly
group
returned
convert
about
final
whose
appear
lexicographically
answeri
place
distance
replace
required
being
corresponding
extra
those
task
substrings
date
delete
below
according
zeros
score
d
appears
numsj
very
odd
turns
out
impossible
traversal
permutation
boolean
information
code
duplicate
----------------------
labeled
leaf
duplicates
itself
whether
still
count
queries
edges
except
formally
deleting
changing
through
numbered
ai
child
8
level
num
water
graph
height
squares
average
along
lists
line
consider
palindrome
placed
equals
1-indexed
kth
swap
together
parentheses
suppose
r
direction
bottom
play
nums1
were
like
area
moving
smaller
subarrays
increasing
insert
random
relative
resulting
bi
plane
types
common
trees
concatenated
decimal
divide
good
become
accepted
occurrences
stones
takes
results
playing
reverse
sort
been
none
absolute
negative
under
go
chosen
concatenation
people
correct
uppercase
fit
put
becomes
4-directionally
abc
map
complete
initial
------------------------
conditions
price
certain
bits
check
prefix
expression
see
define
alice
corner
again
never
infinite
l
already
players
parent
nums2
during
coordinates
rectangle
flip
calls
including
optimally
among
constraints
z
shortest
ones
too
goal
however
let
built-in
text
columns
removes
highest
applying
written
build
might
changed
si
know
call
lower
necessarily
undirected
player
pass
lengths
followed
p
arrlength
arrj
just
paths
repeated
numslength
invalid
obtain
added
arranged
days
spaces
outside
bst
interval
user
twice
over
stone
process
present
nth
his
cost
third
modify
follow
bob
pointer
unit
rotate
names
repeating
constant
customer
signed
ab
run
shown
width
mat
s1
s2
functions
o1
perform
horizontal
apply
singly
runs
ids
report
employee
occurs
simultaneously
diagonal
larger
foreign
special
divisible
bit
inserts
performing
choosing
passed
fits
permutations
construct
e
color
instead
calculate
pattern
adding
places
side
continue
directions
keys
rest
11
subset
frequency
vertical
jump
solutions
queriesi
-----------------------
forward
ending
achieve
lowest
users
separated
u
occur
leftmost
filled
file
occurrence
partition
long
division
our
sequences
upper
subsequences
east
west
said
based
win
winner
groups
uses
customers
cover
entire
matches
city
located
rounded
inside
solve
per
gets
n-1
pointsi
vertically
connecting
back
front
jth
actual
money
power
stack
o
bottom-right
arr1
v
inserted
beginning
prices
endi
starti
intervals
taken
transactions
satisfies
replacing
mentioned
done
obtained
program
rotation
repeat
numsk
123
arr0
network
removed
walk
x-axis
north
south
minutes
store
exceed
wins
units
properties
stop
state
lexicographical
around
employees
edgesi
include
userid
meaning
constructed
231
expressions
dictionary
rightmost
round
judge
in-place
implementation
top-left
addition
played
needs
he
consist
seconds
profit
making
non-overlapping
land
maximize
adds
subtree
bool
operator
ordering
randomly
choice
significant
encoded
arithmetic
a1
a2
denote
receive
clockwise
reversed
red
blue
modifying
open
keep
1000
support
100
select
standing
deleted
reaches
immediately
subtract
well
individually
remains
rotated
here
wall
limit
merge
neighbors
wants
location
x-y
visited
intersection
circular
sign
horizontally
queue
island
coordinate
plus
tie
nums0
box
placing
asked
10-5
olog
item
pop
push
alphabet
probability
runtime
assuming
abcde
transform
several
prime
buy
sell
middle
flips
share
depth
overlapping
stock
combinations
later
going
memory
print
currently
recall
now
operators
friends
friend
condition
real
evaluates
concatenate
instance
threads
system
alternate
period
arrk
equally
increment
xor
circle
g
leaves
labels
label
palindromic
colors
create
minute
themselves
chessboard
white
collection
rectangular
subtrees
what
holds
year
multiplication
additional
belong
please
serialization
forms
stream
reorder
positioned
center
necessary
vi
ui
off
backward
event
double
shows
vertices
answerlength
productid
floor
boxes
definition
wikipedia
language
items
pushes
supports
custom
andor
rearrange
examples
assigned
found
say
series
sets
intervalsi
inputs
specific
insertion
completely
far
h
collect
pricesi
weight
remain
much
non-zero
match
job
finish
higher
denoted
divided
satisfy
specifically
x1
content
symbol
subsequent
concatenating
parts
costs
12
public
thread
-3
address
version
rotating
f
sums
coins
pile
connection
cycle
degrees
straight
90
w
q
half
chooses
stored
begin
leave
rearranging
bottom-left
top-right
rectangles
greatest
candies
lets
ranges
food
customerid
orders
closed
brackets
emails
directed
visit
doing
covered
capacity
explanation
cut
read
assign
suffix
onto
stonesi
described
trailing
repeatedly
seats
locations
fromi
trip
toi
nearest
col
boundary
perfect
social
simplified
included
treat
triangle
strs
neighboring
reconstruct
formatted
sold
quantity
-231
sides
allow
descendant
ancestor
doesnt
languages
broken
salary
expected
arrarrlength
additionally
decide
swapping
linear
eat
querieslength
preorder
-------------------------
products
25
13
subsets
thus
students
student
stops
destination
diagonally
block
nodeval
started
-------------------
puzzle
complement
combination
disjoint
five
subtraction
work
picked
image
makes
printed
surrounded
maximal
132
321
mean
aa
chunk
chunks
distribute
root-to-leaf
y1
high
course
differs
environment
base
works
01
leaving
satisfied
cards
particular
ensure
solutionint
likely
come
piles
obstacle
robot
balanced
tile
neighbor
longer
append
attack
axis-aligned
exact
matching
causes
running
triplets
company
2n
whole
i-th
month
piece
email
script
shape
fall
moment
swaps
update
getint
internal
serialized
generates
multiply
partitioning
balloon
closest
changes
blocked
40
pointers
reports
manager
library
fully
phrase
reads
calendar
events
enum
media
website
belongs
30
bank
ignoring
valuesi
deletion
source
travel
radius
sequentially
ri
islands
heights
productname
jumps
indicate
evaluate
intermediate
room
anywhere
named
gridij
parallel
alternating
median
anagram
others
draw
night
houses
house
symbols
arr2
wordsi
pushint
api
own
inserting
continues
finally
evaluation
variable
calculated
lose
weights
stay
cols
word2
existing
word1
ans
ansi
lefti
ugly
decided
strange
26
mapping
recent
formula
performed
computed
stand
break
non-space
limited
ignored
collected
continuous
insertint
differ
fixed
engage
hamming
free
trying
window
restaurant
scores
nine
27
full
rating
available
decreasing
associated
rooted
slength
endtime
starttime
reformat
hold
beyond
wait
copy
periods
wrong
shorter
21
104
help
balls
intersect
minimized
previously
1234
standard
die
unknown
usual
x2
removal
low
minimize
latest
boundaries
hasnext
simple
comes
ace
threshold
heighti
lines
nothing
encoding
handle
generate
manner
requirements
cycles
leetcode
nums2j
1st
2nd
3rd
look
keyboard
typed
unary
mathematical
scheduled
ip
configuration
lie
partitions
costi
triple
hidden
an-1
connections
forming
unable
parameter
reached
repeats
replaced
domino
labelled
fourth
colored
compressed
enter
owner
knows
customersi
black
queens
zigzag
region
equivalent
roots
mod
replacement
resulti
giving
planning
orderdate
preferred
immediate
close
keeping
graphij
wi
occupied
tiles
meet
falls
key-value
putint
derived
seq
reduce
cuts
better
attributes
dont
besides
2s
traveling
balloons
keeps
c1
counterclockwise
card
due
trips
car
bidirectional
alphanumeric
converting
happens
booking
half-open
implementing
cause
causing
bookint
inclusively
daily
activity
provide
lexicographic
deletions
ki
partitioned
sales
sale
numsn
toward
descendants
staircase
s3
overall
typically
guarantee
police
rob
automatically
alerting
contact
indexed
rounds
department
implemented
expectednumsi
assert
assertions
expectednums
expectednumslength
parser
addresses
255
dots
cardinal
eight
moved
knight
maximized
pay
variables
details
gain
live
persons
well-formed
x-coordinate
effect
counts
inorder
hour
give
apple
str2
str1
taking
downward
lands
record
factors
team
paired
rule
unless
eating
candy
composed
missing
happy
underlined
234
minimal
requests
status
school
bitwise
recursively
goes
pivot
applies
numsnumslength
height-balanced
dies
loses
merged
timei
infected
regions
dot
compare
max
opening
display
shift
submatrices
transaction
tuples
notation
unsigned
therefore
affect
consecutively
grouped
counted
seven
compute
candidates
perimeter
descending
simply
instances
500
50
direct
jobs
slots
accounts
received
simplicity
finishes
simulate
minus
interface
movement
singly-linked
getrandom
pairsi
partially
aaa
righti
vowels
elevation
1n
testcases
grid00
gridm
perm
permi
built
n2
a0
calling
decrease
bar
tweet
tweets
parenthesis
parents
dollars
guess
regardless
60
stores
small
distances
kind
grow
away
logs
searchword
contained
depending
reference
roll
coming
forest
dead
targetsum
dashes
y2
numeric
removals
transformation
rearranged
else
similarly
working
judged
iterator
flatten
possibilities
initialized
unsorted
poor
constructor
ball
computer
field
filetxt
wordlist
0000
-2
2-d
modified
135
erasing
clear
yellow
endpoint
etc
link
blocks
method
identical
whenever
phone
structurally
entries
numsk-1
title
queriesj
rowi
seat
flight
xs
existed
produce
mountain
deserialized
deserialize
property
filling
happen
serialize
buffer
timestamp
tokens
-x
returning
nums1i
alices
disturbing
waiting
proven
endpoints
future
101
adjacency
answer0
answer1
libraries
writing
resultant
examine
typing
ascii
24
arrange
though
foo
tests
trivially
differences
successive
ipv4
fn-1
f1
reset
shuffling
paint
varying
pilesi
left-to-right
digitsi
encodedi
-9
a4
obeys
a3
server
servers
indirectly
connectionsi
obstacles
pos
tails
internally
continuously
performs
faces
forever
kinds
halves
rotations
dominoes
fifth
compress
chars
throughout
enters
secret
king
queen
individual
quantities
cutting
spell
us
rectanglesi
root2
root1
1337
partial
15
force
candiesi
arrive
garden
delivery
percentage
specify
earliest
sunday
monday
tuesday
imagine
yourself
statement
show
supposed
driver
matter
acyclic
hi
matij
shapes
wooden
speed
walking
s1i
cache
initialize
exceeds
recently
seqlength
seqi
stick
refer
similar
photo
checks
frequencies
bursting
xy-plane
flat
burst
merging
connect
cant
snake
r1
spans
linked-list
communicate
remember
deck
face
decki
entry
passengers
drop
boomerang
struct
populate
employeeid
age
managers
reporting
component
border
traverse
successfully
activitytype
activities
denominator
assumed
choices
--
ignore
bomb
postorder
vertex
vyz
bef
abcdefuvwxyz
chose
timesi
send
uniform
xcenter
ycenter
peoplei
20
password
sea
rain
ci
splitting
--------------------
saleid
list2
figure
list1
truncate
eval
worddict
reused
segmentation
lca
climb
axes
afterward
anagrams
stashed
tonight
robber
security
professional
street
main
held
counter-clockwise
track
retrieves
departmentid
departments
testing
things
important
19216811
appeared
chess
011
e2
v1
terms
evaluated
protected
legal
outer
e1
innermost
v2
checked
120
cities
weighted
reachable
weighti
y-coordinate
hand
huge
divides
landing
positionsi
tallest
leftright
dropping
advance
teams
optionally
provided
eaten
molecule
2019
sellerid
buyerid
info
zeroes
quarter
entering
unlock
entered
labelsi
recursive
conversion
term
objects
getting
partner
dividing
prefers
preference
queues
orange
actions
calculator
distancei
bus
num1
biginteger
num2
factor
4th
jumping
separating
personid
had
captured
mm
yyyy-mm-dd
multiplied
coefficient
chef
contaminated
install
installing
walls
world
spreading
treenode
joined
compared
rotten
abcd
segments
freely
numrows
shifts
bounds
n-queens
java
compiler
known
games
objective
reversing
warehouse
expansion
dash
leetcodecom
mail
domain
res
layout
hours
rank
startj
iv
xxvii
400
900
numerals
ii
six
usually
ix
numeral
xii
xx
iiii
principle
roman
subordinates
pad
10000
involving
having
amounts
account
balance
pricei
filter
restaurants
supply
sit
port
ship
weightsi
buzz
printnumber
prints
fizzbuzz
fizz
console
token
songs
song
puts
temperature
temperatures
handling
earlier
stonevalue
li
312
213
addnumint
23
startvalue
allocate
finds
iteration
repetition
abcba
modifies
105
starttimei
able
endtimei
youre
raining
trap
reformatted
marked
tries
sensitive
kept
removeduplicatesnums
0124567
4567012
an-2
linked-lists
majority
arrives
worry
access
pyramid
liquid
topmost
pathsi
outgoing
reading
feed
tweetid
followerid
listinteger
news
closing
deep
inputoutput
stacks
intersecting
excluding
non-null
tell
freq
specified
59
monitor
overlap
basket
baskets
positioni
16
euclidean
apples
earn
fill
till
buckets
falling
awesome
appended
doubly
notes
supported
double-ended
normal
peekpop
natively
deque
applied
powx
05
curr
boardrc
constraint
02
preceding
lead
sn
decrement
designed
article
fewer
pre-order
flipping
furthermore
paper
cited
citations
h-index
citationsi
researchers
papers
published
researcher
reminder
towards
diagram
treated
slash
directory
directories
filedirectory
minimizes
triplet
unlimited
route
sure
102
coin
quality
unfortunately
bad
turned
buttons
bulbs
deepest
searches
assignment
flattened
nested
rx
union
searchstring
includes
reaching
asks
request
sub-arrays
2h
spend
sj
sub-boxes
solvable
1-9
sudoku
submatrix
in-order
factory
disconnected
log
sk
beginword
endword
neither
converts
whitespace
determines
32
wheel
turning
displays
tickets
segment
divisor
losing
fractional
arr1i
arr2j
arr1length
---------------------------
project
green
local
mark
viewed
ground
shifting
indicesi
pi
addint
correspond
decoded
numsright
numarrayint
sumrangeint
numarray
numsleft
00
2359
hhmm
manhattan
yj
stacked
bac
ccc
marking
run-length
sliding
spiral
degree
absi
movements
hexadecimal
bsts
february
2020
recover
upper-case
vowel
t1
t2
shares
gridrowicoli
coli
picks
flights
reduces
allows
insertstring
companys
sourcei
rearrangement
container
destroyed
smash
relationships
fx
counter
happened
tic-tac-toe
excel
28
sheet
precedence
quote
sy
ty
tx
sx
transmitted
across
restriction
serializationdeserialization
reconstructed
mapped
multiplicity
ties
2x
64-bit
os
arriving
nums3
respect
movesi
origin
calculates
rootval
aec
arrival
capture
peek
attacking
duration
separate
pascals
fraction
calculations
invalidate
x0
nums1length
010
spread
minitial
malware
printer
ability
visits
equations
equationsi
nor
unoccupied
exam
describes
listnode
numsn-1
numsk1
monotone
lower-case
vice-versa
comma-separated
non
bash
frequent
try
cat
mouse
occupies
even-indexed
odd-indexed
walked
frog
frogs
efficiently
sitting
behind
removekey
hash
numsr
numsl
alphabetical
prerequisitesi
courses
numcourses
prerequisites
heads
spellchecker
retrieve
bbb
removeint
sub-array
self-edges
connects
equation
folder
subjected
formats
anything
erase
app
rational
0110
comprises
pressed
sometimes
ti
maxcost
restricted
executed
printsecond
mechanism
operating
comprehensiveness
printthird
mainly
seem
printfirst
imply
wiggle
non-equal
-7
contrast
defanged
replaces
arrk0
f0
clock-wise
arrkn
fk
arrk1
shuffle
resets
preserve
painting
3n
proved
1021
2510
121241510
-5
ranging
requirement
critical
server-to-server
eliminate
begins
anti-clockwise
stands
y-axis
instructions
bottomsi
topsi
tops
bottoms
labelling
sixth
b1
b2
uncolored
separately
preserved
grumpy
technique
grumpyi
bookstore
queensi
xqueeni
xking
yqueeni
yking
ad
stickers
sticker
extremely
wildcard
cdefab
cdabef
abefcd
efcdab
abcdef
efabcd
acdbef
drawing
desiredtotal
re-use
pool
maxchoosableinteger
kids
extracandies
kid
denoting
bitwise-xor
flying
interview
bcosti
fly
costsi
acosti
array-form
1321
one-dimensional
taps
tap
rangesi
watered
precisely
customerprefdeliverydate
deliveryid
--------------------------------------
saturday
week
wednesday
friday
thursday
bracket
compile
graphi
dag
envelopesi
envelopes
envelope
doll
russian
nearly
everyone
tromino
tiling
tilings
ants
plank
ant
s2j
lru
evict
lrucache
lrucacheint
abcabc
sticks
cutsi
wish
alone
mirrored
180
terminator
signifies
recurse
solving
understand
quad-tree
proper
two-dimensional
sub-grids
topright
bottomleft
section
wiki
topleft
isleaf
bottomright
sub-grid
1221121221221121122
few
magical
22
multiplicand
streamchecker
accepts
axyz
detect
querychar
xyz
streamcheckerstring
watchedvideosi
alphabetically
general
videos
friendsi
watchedvideos
watched
y-direction
spherical
stretches
infinitely
taped
xend
arrows
arrow
shot
xstart
diameter
y-coordinates
size1
size2
costij
opposite
prison
cellsi
vacant
n-2
horizontalvertical
nn
ln
l1
l2
l0
wear
hats
hatsi
arrx
arry
adjacentpairsi
adjacentpairs
numsi1
forgotten
unrevealed
revealed
reveal
minsize
maxsize
maxletters
drives
kilometers
vehicle
cars
tripsi
numpassengersi
drive
fw
fs
dcce
fqueriesi
anyone
reportsto
gridrowcol
sqrt
typei
traversed
non-alphanumeric
mycalendar
scrolldown
sessionid
activitydate
endsession
session
active
2019-07-27
someday
opensession
sendmessage
non-repeating
exclusive
less-than-or-equal-to
fractions
mutations
mutation
startgene
gene
investigate
aaccggtt
8-character
mutate
records
endgene
aaccggta
abccdef
cbca
completing
insensitive
caaacab
licenseplate
12c
code0
decrypt
decrypted
defuse
informer
coden-1
asteroids
explode
collisions
asteroid
triangulate
n-sided
triangulation
polygon
convex
triangles
secondary
diagonals
strs0strs0length
strs01
strs11
strs00
strs1strs1length
strs10
signal
solutiondouble
circumference
randpoint
queuej
hj
queue0
kj
met
weak
strong
baaba0
baaabb0
touches
flow
oceans
atlantic
receives
pacific
borders
ocean
heightsrc
lot
neccesarilly
selects
sizes
ath
list1s
bth
sentences
sentence
cubic
touching
cube
storeroom
non-obstacle
4-directional
walks
climbing
mn
ps
differently
bobvaluesi
alicevaluesi
bobvalues
alicevalues
friendshipsi
friendships
friendship
languagesi
transitive
teach
meanwhile
2-1
lenarr
patches
addpatch
score1
score0
score25
beforeitemsi
belonging
relations
groupi
meal
deliciousnessi
meals
deliciousness
foods
sectors
roundsi
marathon
rounds1
sector
rounds0
circulate
namely
minstack
retrieving
getmin
shouldnt
rand10
rand7
argument
preserving
isomorphic
actuallength
removeelementnums
equaling
sortnums
al
command
interpret
parsers
interpreted
interpretation
amongst
0011255245
1921681312
012201
ocurrences
orthogonal
uniformly
attempts
stopped
illustrated
redistribute
110
considering
scope
convenience
question
lisp-like
en
context
syntax
expr
concept
vn
scopes
mult
introverts
introvert
introvertscount
happiness
extroverts
extrovertscount
living
extrovert
distancethreshold
uk
u1
vk
u2
sumnumsi-numsj
summation
invert
felt
detonate
bombsi
bombs
whereas
further
detonated
countsi
arrlen
popped
pushed
angle
pizza
pieces
k-1
heap
nim
bs
aacabb
bbcbaa
attain
aecdb
dropped
brushing
sidelengthi
freezes
aligned
landed
super
primes
tournament
advances
candiescounti
favoritedayi
candiescount
dailycapi
favoritetypei
identify
abbreviated
useful
10-letter-long
acgaattccg
dna
nucleotides
studying
super-palindrome
super-palindromes
join
orderid
itembrand
favoritebrand
buyer
online
joindate
itemid
shopping
changedate
2019-08-16
newprice
saledate
2019-03-31
2019-01-01
unitprice
loops
endlessly
mirror
symmetric
242
14312
274
4237214
1412
checking
012
unlocks
345
012345
peculiar
safe
incorrect
uselimit
numwanted
countandsayn-1
3322251
count-and-say
countandsay1
countandsayn
saying
converted
librarys
124789
89
37
23489
cancelledbydriver
cityid
rate
clientid
requestat
2013-10-03
canceled
banned
role
completed
unbanned
yes
taxi
cancelledbyclient
client
usersid
2013-10-01
driverid
cancellation
referred
sandwichesi
studentsj
sandwiches
sandwich
cafeteria
lunch
offers
positives
kitchen
oranges
basic
scramble
scrambled
wrap-around
ologm
indexs
12344
14234
index2
numbersindex2
index1
numberslength
numbersindex1
farthest
5th
odd-numbered
even-numbered
6th
matrc
answerij
firstname
addressid
lastname
knights
health
demons
rooms
rescue
threats
fight
power-ups
quickly
her
orbs
upon
guarded
decides
dungeon
rightward
valiant
magic
laid
imprisoned
princess
increase
drops
accommodate
dec
jul
yyyy
apr
jan
mar
jun
oct
2100
1900
sep
31st
30th
feb
dd
aug
nov
satisfactioni
like-time
discard
cook
dish
satisfaction
dishes
prepared
preparation
uninfected
threatens
resources
affected
isinfected
quarantine
virus
shared
installed
isinfectedij
modeled
rapidly
spreads
cbtinsertertreenode
cbtinserter
getroot
revisions
001
version1
revision
2533
version2
elapse
fresh
containedboxesi
initialboxes
statusi
keysi
containedboxes
abcc
lasted
clips
video
clipsi
ended
sporting
clip
-numsi
legibility
pahnaplsiigyir
font
convertstring
paypalishiring
bcdea
wisely
painted
backslash
blank
escaped
fee
maxm
2m
reordered
0-9
out-of-order
storekeeper
visitedon
averageamount
paid
analyze
candidate
underscore
e-mail
e-mails
12312
2height1
res0n-12
resr1c2height-r-1
resr1c-2height-r-1
resrc
non-tiring
well-performing
tiring
worked
ranked
floating
holes
ranking
ranks
secondlist
firstlisti
pairwise
firstlist
secondlistj
endj
employeesiimportance
indirect
employeesiid
employeesisubordinates
importance
bijection
jobdifficultyi
difficulty
dependent
difficulties
jobdifficulty
schedule
approach
justified
evenly
greedy
left-justified
distributed
maxwidth
pack
transferred
transactedon
transid
maxdistance
filters
idi
restaurantsi
maxprice
filtering
veganfriendlyi
ratingi
veganfriendly
putrightfork
pickleftfork
fork
philosophers
bowls
wantstoeatphilosopher
demand
concurrent
silent
wikipediaorg
spaghetti
philosopher
putleftfork
discipline
forks
think
behaviour
asking
alternately
stomach
starve
pickrightfork
thinking
maxweight
portsi
maxboxes
deliver
loaded
delivered
ports
carry
boxesi
storage
delivering
respective
violating
portscount
limits
numberprintnumber
printfizzbuzz
printbuzz
fizzbuzzint
printfizz
buzzprintbuzz
fizzbuzzprintfizzbuzz
fizzprintfizz
boredom
playlists
music
playlist
listen
avoid
setindex
array-like
took
snapshotarray
snapshot
snap
snapshotarrayint
getindex
snapid
forwardbackward
seq0
backwards
numsseqj
seq1
seqk
spots
spot
valuesj
sightseeing
solutionlistnode
numsb
numsa
quadruplets
numsd
numsc
weather
recorddate
yesterday
dates
strs2
strsn
strs1
strs0
rectsi
rects
heshe
totally
pairings
preferencesi
preferences
pairing
unhappy
patientid
patientname
diabetes
diab1
patients
hospital
dominoesi
dominoeslength
dominoesj
46
maxlen
labeling
listing
findmedian
medianfinder
graphical
iterates
growing
consuming
n-ary
nary-tree
73412
stocks
span
today
todays
nextint
7212
collects
stockspanner
quotes
queries4
queries3
bc
abcda
lyb
queries1
sleftirighti
queries2
baab
abba
palidrome
010221
330120031032041
falsetrue
truefalsefalsetruetrue
queries0
bacd
cd
alike
profiti
obtaining
mid
heightmap
volume
abdbec
str
n1
bolded
abcabcabc
appending
copies
oxygen
releaseoxygen
bind
barriers
molecules
hydrogen
enforces
methods
releasehydrogen
bond
synchronization
explicitly
barrier
excess
pictured
100th
champagne
poured
pouring
cup
glasses
glass
cups
citybi
cityai
loop
histogram
histograms
index-0
uniques
bce
cae
post
followeeid
getnewsfeedint
twitter
unfollowint
unfollowing
composes
followint
posted
themself
posttweetint
followunfollow
numbottles
drink
bottle
market
bottles
numexchange
exchange
drinking
xrandom
copied
randomindex
brand
dinnerplatesint
popatstackint
dinnerplates
enddate
averageprice
selling
unitssold
purchasedate
startdate
oriented
ancestors
extending
end-nodes
calculation
levels
guessing
tweet3
3600-second
gettweetcountsperfrequencystring
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
721010000
tweetcounts
tweetcountsgettweetcountsperfrequencyhour
1069
tweetname
tweetcountsgettweetcountsperfrequencyminute
997010000
210
recordtweetstring
tweetcountsrecordtweettweet3
103609
analysis
059
gettweetcountsperfrequency
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
recorded
60-second
6060
36107209
analyzing
130189
0210
70129
1010000
recordtweet
nullnullnullnull221null4
frequencys
86400-second
site
sxy
sij
10n
earth
discovered
invented
c-137
rick
universe
stated
morty
magnetic
jumbo
ingredients
slice
totaljumbo
burgers
tomatoslices
slices
cheese
totalsmall
cheeseslices
tomato
burger
xcentre
ycentre
service
2d-map
daysi
doctors
grows
rot
applesi
minb
sorting
autoincrement
baddadmadpadbadadb
worddictionarysearchpad
finding
worddictionarysearchad
worddictionaryaddworddad
wordlength
addwordword
addword
worddictionarysearchbad
worddictionaryaddwordmad
worddictionary
worddictionaryaddwordbad
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
nullnullnullnullfalsetruetruetrue
matched
worddictionarysearchb
afterwards
pour
jug
jugs
jug2capacity
liters
jug1capacity
capacities
measurable
targetcapacity
measure
1232
deviation
2234
pointerreference
addatheadint
addattailint
mylinkedlist
attribute
deleteatindexint
prev
indexth
addatindexint
last-in-first-out
mystack
lifo
incomplete
grayscale
rounding
img
surrounding
smoother
printbar
printfoo
foobar
k-repeating
python
exponent
mincurr
-14-13
boustrophedon
simulates
style
destinations
boardn
6-sided
ladder
stopping
robbing
systems
warm
heaters
warmed
winter
contest
heater
rabbit
rabbits
answersi
additive
03
differing
occurring
reverseinvertsi
reversex
s4
inverts
011100110110001
0111001
invertx
tuple
boomerangs
matters
arrrighti
arrlefti
under-population
life
interacts
1970
horton
reproduction
john
wikipedias
deaths
caused
british
mathematician
created
lives
births
conway
devised
automaton
cellular
generation
over-population
desired
flipped
uniquely
voyage
license
logarithmic
eed
basestr
relation
implies
aab
s2i
equivalency
acd
symmetry
transitivity
reflexivity
cde
equivalence
aba
space-separated
segmented
fingers
up-left
0156
aj
0190
fghij
pqrst
board00
uvwxy
klmno
images
unix-style
canonical
slashes
refers
boxtypesi
truck
boxtypes
numberofboxesi
numberofunitsperboxi
trucksize
homework
lays
querytime
finished
distribution
gift
numpeople
weld
installation
welded
steel
billboard
rods
journey
station
stations
gasi
1th
circuit
gas
tank
quantityi
indexi
numsindexi
vali
sequential
beautiful
representations
0-59
pm
1002
watch
451
turnedon
0100
led
leds
0-11
denominations
fewest
fails
develop
versions
isbadversionversion
developed
progression
haystack
needle
press
functionality
presses
button
statuses
3k
tright
tleft
suff
wordfilter
wordfilterstring
fstring
pref
winston
func
funcarr
mysterious
vice
versa
blength
vps
maxdeptha
deptha
depths
vpss
encodes
alength
depthb
nesting
workers
devise
worker
optimal
jobsi
mine
collecting
gold
swim
everywhere
pseudocode
nestediteratorlistnestedinteger
nestedlist
nestediterator
tested
iteratornext
iteratorhasnext
rabcd
abdfh
singleton
rabc
understood
abdfg
acefh
abefh
acadbcbd
rexpr
re1
comma-delimited
rw
rabcdefgh
grammar
ra
acdfg
concatenations
cartesian
rabbc
ek
re2
best
abefg
acefg
acdfh
grandparent
even-valued
magicdictionary
builddictstring
matrixs
mat20
mat31
mat42
secondlen
firstlen
numsendi
requestsi
numsstarti
rides
traveled
travelleddistance
battleship
separates
battleships
lengthwordj
lengthwordi
cardpoints
gridi
gridin
text1
text2
hasapple
hasapplei
camera
cameras
allotted
bucket
pig
survive
pigs
poisonous
minutestotest
consume
fed
minutestodie
128
self-dividing
ij
validated
reordering
lakes
horizontallyvertically
isnt
non-existent
initializing
bstiterator
bstiteratortreenode
bottom-up
bitwise-and
triples
exchanges
highlimit
infinity
lowlimit
computers
cables
extract
ethernet
digit-logs
identifier
identifiers
contents
maintain
space-delimited
letter-logs
permitted
chalkboard
distance3
distance2
distance0
distance1
crosses
meters
transpose
ryan
cousins
0032
non-digit
clamped
clamp
atoi
myatoistring
ccs
codes
lock
deadends
slot
wrap
wheels
30-day
1-day
365
7-day
passes
costs2
costs1
train
costs0
planned
alphabetic
abe
quotient
-27335
dealing
dividend
8345
truncated
spanning
shaped
stuck
corners
hits
redirect
boards
redirects
arr2length
experience
projectid
years
experienceyears
suggested
suggests
minimums
n3
janfebmaraprmayjunjulaugsepoctnovdec
revenue
consistent
forgot
whitespaces
indexes
aforementioned
imageij
sr
imagesrsc
pixel
flood
pixels
sc
competitive
134
variation
zuma
global
inversions
matrixij
n-digits
nummoves
contour
x1y1x2y2
geometric
collectively
grounded
34
surface
511
512
skyline
57
silhouette
citys
building
acceptable
buildingsi
termination
skylines
absolutely
buildings
wrapping
shuffled
she
neededtimei
rope
colorful
colorsi
neededtime
downwards
outermost
decomposition
primitive
nonempty
p2
pk
p1
appends
kthlargest
kthlargestint
non-leaf
encodedstring
kencodedstring
3a
ramp
leadids
leadid
partnerids
dailysales
partnerid
makename
dateid
matchsticks
matchsticksi
matchstick
hh
24-hour
fix
xj
2d-plane
beneath
triangular
pleasing
three-letter
stacking
patterns
aesthetically
centered
aabccc
compression
a2bc3
c3
valued
disconnect
side-length
turbulent
comparison
valuediff
absnumsi
indexdiff
cabxe
cabxbae
ba
cxbae
diagaram
dial
indicated
managerid
twos
24130
corresponds
worth
13024
createdat
movieid
review
rated
movie
movierating
movies
todelete
swapped
mistake
020010db885a3000000008a2e03707334
x1x2x3x4x5x6x7x8
queryip
192168100
xilength
20010db885a3000000008a2e03707334
20010db885a38a2e037j7334
19216810
192168011
x1x2x3x4
ipv6
2001db885a3008a2e03707334
qj
disi
edgelist
pj
limitj
edgelisti
0144567
4567014
maintaining
succprobi
traversing
1e-5
success
-k
interleaving
tm
t3
k-bit
approved
declined
incoming
country
transdate
lampsi
gridrowjcolj
listed
lamp
lamps
colj
illuminated
rowj
illuminates
answering
ansj
jewels
ccenter
rcenter
r2
c2
ticket
airplane
passenger
lost
reserved
seatsi
lasti
bookings
bookingsi
firsti
10010
00010
00001
ys
locationsi
fuel
locationsj
locationslength
routes
overridden
sumstring
mapsum
maps
key-val
interested
earners
seeing
executives
earner
earns
salaries
allowedswapsi
allowedswaps
targeti
formatting
reformatting
firstly
productcategory
members
arrangement
ax2
rectilinear
ax1
by1
by2
bx2
bx1
ay2
ay1
blacklist
optimize
blacklisted
booksi
books
book
shelf
thicknessi
thickness
shelfwidth
bookcase
bookshelf
shelves
increased
urgent
inform
managerheadid
subordination
informtimei
headid
manageri
nestedinteger
39916800
f11
f3
convention
past
pingint
ping
frame
3000
milliseconds
recentcounter
t0
tn2
tn1
tribonacci
tn3
tn
13579
3-1-5-9
7777
web
pages
developer
page
sub-sequence
repetitions
soldiers
strongest
weakest
civilians
weaker
columnnumber
heightj
dimensions
lengthj
cuboidsi
widthj
cuboids
lengthi
cuboid
widthi
groupsizes
groupsizes1
groupsizesi
tilesi
minh
mhts
hercy
putting
save
implicit
control
macros
comment
newline
eventually
effective
defines
yet
comments
interfere
odd-valued
creative
clarification
serializes
approaches
appearing
043
operands
toeplitz
peaks
peak
nums-1
matrixxy
closer
a-z
grouping
06
11106
message
decode
aajf
kjf
machineid
processid
float
machine
machines
processingtime
processes
divisions
73
onlogn
yields
distributing
incompatibility
incompatibilities
3bb
well-formatted
aabc
breaking
3aab
5c
-2aaa
evalints
-1a14
evalvars
counting
-6
asterisk
alternates
4a
heaviest
kn
dice
face-up
orderedstream5
orderedstreamint
concatentating
bbbbb
constructs
eeeee
osinsert3
valuelength
ddddd
aaaaa
arbitrary
idkey
osinsert4
orderedstream
ccccc
osinsert2
osinsert1
osinsert5
pre-defined
guessint
nums4l
nums3k
nums4
orderwith
overlapped
irrelevant
robots
facing
completes
magnitude
3x
wrr
warrior
words2
words1
universal
thrown
throws
increases
minn
rootrightval
sub-nodes
minrootleftval
sub-node
4x
compact
prepare
prepares
preparing
idle
waits
arrivali
gives
2d-array
mountainarraygetk
mountainarraylength
mountainarrayget
attempt
circumvent
interactive
mountainarrgetindex
disqualification
mountainarray
submissions
mountainarr
richest
accountsij
wealth
fruit
strict
fruitsi
visiting
fruits
produces
farm
lies
trimming
trim
trimmed
rxxlrxrxl
xl
lx
xr
peekingiteratoriteratorint
peekingiterator
ashe
timeseriesi
poison
hero
timeseries
enemy
attacks
timer
teemo
poisoned
qwertyuiop
american
zxcvbnm
asdfghjkl
viewdate
articleid
viewer
views
authors
author
articles
authorid
viewerid
01101
32-bits
explained
looks
dirsubdir2subsubdir2file2ext
abstracted
extension
subdirectory
new-line
subsubdir1
file2ext
subdir2
opened
subdir1
subdirectories
tab
subsubdir2
file1ext
nameextension
dirntsubdir1nttfile1extnttsubsubdir1ntsubdir2nttsubsubdir2ntttfile2ext
picture
dir
files
non-horizontal
magazine
ransomnote
numerator
enclose
baseball
operationsi
y0
combinationlength
combinationiterator
combinationiteratorstring
arguments
lt
entity
gt
html
apos
amp
frasl
quotation
ampersand
entities
quot
wordsj
wordslength
one-bit
colsumi
colsum
0-thupper
1-stlower
column0-indexed
arr2i
arr1j
permuted
permute
x22
y22
gondolas
serving
gondola
safely
centennial
pays
runningcost
exit
scenario
boardingcost
mall
visitid
transactionid
one-letter
xiyihere
xiyi
currnext
single-level
multilevel
placement
childname
whos
successorx
curorder
parentname
getinheritanceorder
successorbob
grandchildren
someone
successor
son
family
older
successorxs
birthstring
inheritance
member
birth
successorjack
successoralice
kingdom
kingname
throneinheritance
gave
successorking
deathstring
jack
born
death
oldest
throneinheritancestring
well-defined
timej
125
subjects
studentid
examinations
studentname
subject
subjectname
attended
splits
sleft
sright
clone
unordered
finite
cloned
prior
subexprn
logical
subexpr
inner
subexpr2
subexpr1
most-significant-bit
booleans
least-significant-bit
nums0i
barcodes
barcodesi
barcode
indices0-indexed
answerj
orderings
top-to-bottom
telephone
2-9
expectedi
heightsi
annual
reqskills
people3
skill
skills
people1
people0
sufficient
on2
934126
commas
encounter
sentinel
conversions
-1073741825
creating
stages
basically
updated
wordstxt
pipes
unix
sunny
sake
one-line
package
belt
conveyor
shipped
load
packages
road
altitudes
net
altitude
biker
gaini
cba
wordk
bcad
wordb
chain
word3
worda
abac
predecessor
ni
explore
theres
10th
tenth
hole
graph1
grapha
ever
meets
3x3
nodeleft
noderight
traverses
golf
mi
maxnumsj
pending
extended
slant
drawn
ratio
database
poorquerypercentage
queryname
river
assumes
crossing
cross
mycalendarthree
k-booking
integer-sided
majoritycheckerint
arrleftright
queryint
majoritychecker
1101
-22
-23
-20
searchcost
him
cheating
distributions
classroom
eventday
exits
intime
empid
1440
outtime
spent
office
reverses
incremented
lfucache
invalidated
lfu
frequently
lfucacheint
maintained
perm2
perm1i
perm2i
perm1
squareful
million
blockedi
nums2i1
sublists
sublist
decompressed
nums2i
myhashmap
hashmap
mines
gridxiyi
arms
minesi
relevant
gridrc
complementary
serializations
solid
targetgrid
targetgridrowcol
zeroevenodd
010203040506
evenprintnumber
printnumber7
zeroevenoddint
zeroprintnumber
oddprintnumber
updateint
updates
numsindex
insertions
n-bit
gray
skipb
lista
intersectval
intersected
heada
skipa
headb
skip
correctly
retain
ahead
listb
accountsi
accountsi0
definitely
autocomplete
various
pronounced
trie
applications
startswithstring
dataset
lexical
itineraries
airline
itinerary
departure
ticketsi
lgb
man
airports
departs
lga
jfk
toggle
bulb
6741
6174
6141
61741
fair
no-zero
surprisingly
alien
left-most
stamp
targetlength
stamped
nice
related
randomizedcollection
linearly
multiset
col2
row2
nummatrix
sumregionint
nummatrixint
sumregion
col1
row1
fifo
myqueue
150
efficient
entirely
necesssarily
comprised
hashset
containskey
addkey
myhashset
thousands
separator
subgrid
introduced
simulator
rollmax
rollmaxi
rolls
generator
engineer
fxy
findsolution
monotonically
customfunction
fint
implementations
functionid
callable
graphv
bipartite
independent
graphu
countk
floating-point
statistics
sample
mode
non-bull
cows
bulls
ask
hint
xayb
pickint
raised
xn
k1
k2
croakoffrogs
printing
croaks
croak
mixed
determined
dj
evaluating
contradiction
-10
cj
absx
absnumsl
numsr-1
numsl1
newinterval
insufficient
uni-valued
bought
productkey
ac
abcbabcbcb
ababbc
baa
logsi
computing
10101
setstring
timestampprev
time-based
getstring
timemap
stamps
subtexti
subtext2
subtext1
subtextk
columntitle
regular
ratings
tablenumberi
customernamei
fooditemi
ordersicustomernameitablenumberifooditemi
header
numerically
2e10
6e-1
314
1a
-123456e789
-01
0089
--6
components
e3
535e93
1e
99e25
95a54e53
optional
3e7
-90e3
categories
errors
checker
case-sensitive
operates
case-insensitive
yeellow
capitalization
handles
spelling
capitlization
yllw
yollow
mistakes
operand
polish
truncates
4566701244
0124445667
escape
pac-man
ghosts
independently
integral
ghostsi
ghost
xtarget
ytarget
splicing
indexing
i0
p123m
iquerieslength-1
fixed-length
modifications
sent
actually
myemailcom
everything
mynameemailcom
aliceleetcodecom
mails
forwarded
alicezleetcodecom
filtered
emailsi
references
cheapest
flightsi
src
dst
left-out
alter
alal1ar
lr
passing
thorn
cherries
cherry
sorts
arr0k-1
k-values
3214
pancake
chips
chip
bobs
rowindex
rowindexth
sqrt2
bag
potentially
gaining
tokensi
gregorian
forbiddeni
forbidden
bugs
home
bug
election
votes
qint
cast
personsi
topvotedcandidate
tied
topvotedcandidateint
vote
gi
cookies
greed
cookie
getintervals
seen
summary
summarize
summaryranges
solved
123450
short
searchint
performance
red-black
artyom
layers
eraseint
by-sa
80
kalinin
situation
treap
commons
fine
layer
cc
skiplists
comparing
via
45
faster
httpsenwikipediaorgwikiskiplist
wikimedia
skiplist
ologn
idea
comparatively
304050607090
factorial10
factorial
processed
clumsy
clumsy10
folderi
folderj
leetcodeproblems
folders
sub-folder
sub-folders
entrance
smart
himself
directly-linked
thievery
realized
tour
thief
pushing
popfront
popmiddle
frontmiddleback
popback
pushbackint
pushfrontint
frontmost
popping
pushmiddleint
non-increasing
551
1351315
actorid
cooperated
provides
director
actordirector
actor
directorid
aval
bval
mycalendartwo
warmer
tasks
minimumi
actuali
finishing
require
energy
tasksi
incstring
decrements
decstring
increments
getminkey
getmaxkey
allone
12345
0xxxxxxx
110xxxxx
unicode
1110xxxx
n-bytes
utf-8
11110xxx
byte
translates
bytes
10xxxxxx
utf8
-------------------------------------------------------------
1-byte
octet
follower
followers
dfs
depth-first
exceeding
turn1
turnn
kilograms
personname
abcdefg
cabbage
faced
baggage
beefed
puzzlesi
aalength
constructa0
constructb
constructa
routine
constructai
016666
016666666
repeatingpart
1230001
212
conventionally
123001212
integerpart
integerpartnonrepeatingpartrepeatingpart
19
portion
016
nonrepeatingpart
integerpartnonrepeatingpart
nobody
relationship
trust
trusti
identified
rumor
trusts
secretly
everybody
town
couple
couples
switch
hands
fn-2
f2
fibonacci
fn
transactionsi
rededges
blueedgesj
answerx
vj
uj
blueedges
rededgesi
bishop
bishops
pawn
captures
pawns
rook
rooks
duplicated
nums2i2
nums1k
nums1i2
nums2k
nums2length
nums1j
odd-length
0-based
bound
powerful
abcdefghijklmnopqrstuvwxyz
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
wraparound
a-b
op2
op1
adhere
negation
op3
conventions
cooldown
restrictions
plant
flower
planted
i1th
gardens
flowers
xxx-xxx-xxxx
xxx-xxxx
xxx
456-7890
one-liner
7890
456
987-123-4567
findint
recovered
treenoderight
treenodeval
treenodeleft
recovers
treenodeleftval
treenoderightval
findelements
findelementstreenode
h2o
atomic
h1o2
h2o23
chemical
h2o2
atom
h2o2he3mg4
formulas
maxi
mini
p0
pi1
0122n
p2n
catjump
ccatmmouse
staying
floors
mousejump
tracking
queryrangeint
removerangeint
module
rangemodule
tracks
tracked
overlaps
addrangeint
randomizedset
coordinatesi
xy
8-directionally
